load/all_scenarios/.tsung/tsung.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/share/tsung/tsung-1.0.dtd">
<tsung loglevel="debug" dumptraffic="true" backend="fullstats" version="1.0">
  <!-- Client side setup -->
  <clients>
    <client host="tsung-controller" use_controller_vm="true"/>
    <client host="tsung-slave-1"/>
  </clients>
  <!-- Server side setup -->
  <servers>
    <server host="162.209.67.22" port="80" type="tcp"></server>
  </servers>
  <!-- to start os monitoring (cpu, network, memory). Use an erlang
  agent on the remote machine or SNMP. erlang is the default -->
  <monitoring>
    <monitor host="myserver" type="snmp"></monitor>
  </monitoring>
  <load>
    <!-- several arrival phases can be set: for each phase, you can set
  the mean inter-arrival time between new clients and the phase
  duration -->
    <arrivalphase phase="1" duration="1" unit="minute">
      <users arrivalrate="5" unit="second"></users>
    </arrivalphase>
  </load>
  <options>
    <option type="ts_http" name="user_agent">
      <user_agent probability="80">Mozilla/5.0 (X11; U; Linux i686; en-US; rv:1.7.8) Gecko/20050513 Galeon/1.3.21</user_agent>
      <user_agent probability="20">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
    <option name="ports_range" min="1025" max="65535"/>
    <option name="file_server" id='metadata' value="/root/.tsung/queuemetadata.csv"></option>
    <option name="file_server" id='message' value="/root/.tsung/msgbody.csv"></option>
    <option name="file_server" id='claimdata' value="/root/.tsung/claimdata.csv"></option>
    <option name="file_server" id='projectid' value="/root/.tsung/projectid.csv"></option>

  </options>
  <!-- start a session for a http user. the probability is the
  frequency of this type os session. The sum of all session's
  probabilities must be 100 -->
  <sessions>

    <!--
  Scenario-1 :
  1. Create Queue with random name (metadata will be random line from queuemetadata.csv)
  2. Post Message to the queue (message will be random line from msgbody.csv)
  3. Get Message
  4. Get Queue Stats
  5. Delete Queue-->
    <session name="Scenario-1" probability="20" type="ts_http">
      <setdynvars sourcetype="random_string" length="12">
        <var name="qname"/>
      </setdynvars>
      <setdynvars sourcetype="file" fileid="metadata" delimiter=";" order="random">
        <var name="qmetadata"/>
      </setdynvars>
      <setdynvars sourcetype="file" fileid="message" delimiter=";" order="random">
        <var name="msgbody"/>
      <setdynvars sourcetype="file" fileid="projectid" delimiter=";" order="random">
        <var name="project_id"/>
      </setdynvars>

      <!-- full url with server name, this overrides the "server" config value -->
      <transaction name="create_queue">
        <request subst="true">
          <http url="/v1/queues/%%_qname%%" method="PUT" version="1.1" contents='%%_qmetadata%%' content_type='application/json'>
            <http_header name="User-Agent" value="Tsung-Agent"/>
            <http_header name="Client-ID" value="Tsung-Client"/>
            <http_header name="X-Auth-Token" value="XXXXX"/>
            <http_header name="X-Project-ID" value="project_id"/>
          </http>
        </request>
      </transaction>

      <transaction name="post_message">
        <request subst="true">
          <http url='/v1/queues/%%_qname%%/messages' version='1.1' contents='%%_msgbody%%' content_type='application/json' method='POST'>
            <http_header name="User-Agent" value="Tsung-Agent"/>
            <http_header name="Client-ID" value="Tsung-Client"/>
            <http_header name="X-Auth-Token" value="XXXXX"/>
            <http_header name="X-Project-ID" value="project_id"/>
          </http>
        </request>
      </transaction>

      <transaction name="get_message">
        <request subst="true">
          <http url='/v1/queues/%%_qname%%/messages' version='1.1' content_type='application/json' method='GET'>
            <http_header name="User-Agent" value="Tsung-Agent"/>
            <http_header name="Client-ID" value="Tsung-Client"/>
            <http_header name="X-Auth-Token" value="XXXXX"/>
            <http_header name="X-Project-ID" value="project_id"/>
          </http>
        </request>
      </transaction>

      <transaction name="queue_stats">
        <request subst="true">
          <http url='/v1/queues/%%_qname%%/stats' version='1.1' content_type='application/json' method='GET'>
            <http_header name="User-Agent" value="Tsung-Agent"/>
            <http_header name="Client-ID" value="Tsung-Client"/>
            <http_header name="X-Auth-Token" value="XXXXX"/>
            <http_header name="X-Project-ID" value="project_id"/>
          </http>
        </request>
      </transaction>

      <transaction name="delete_queue">
        <request subst="true">
          <http url="/v1/queues/%%_qname%%" method="DELETE" version="1.1">
            <http_header name="User-Agent" value="Tsung-Agent"/>
            <http_header name="Client-ID" value="Tsung-Client"/>
            <http_header name="X-Auth-Token" value="XXXXX"/>
            <http_header name="X-Project-ID" value="project_id"/>
        </http>
        </request>
      </transaction>

      <!--GET on a deleted Queue - Returns 404 -->
      <transaction name="get_queue">
        <request subst="true">
          <http url="/v1/queues/%%_qname%%" method="GET" version="1.1">
            <http_header name="User-Agent" value="Tsung-Agent"/>
            <http_header name="Client-ID" value="Tsung-Client"/>
            <http_header name="X-Auth-Token" value="XXXXX"/>
            <http_header name="X-Project-ID" value="project_id"/>
          </http>
        </request>
      </transaction>
    </session>


    <!--
  Scenario-2 :
  1. Create Queue with random name (metadata will be random line from queuemetadata.csv)
  2. Post Message to the queue (message will be random line from msgbody.csv)
  3. Get Queue metadata
  4. Update Queue metadata (metadata will be random line from queuemetadata.csv)
  5. Delete Queue
  6. Get Queue-->
    <session name="Scenario-2" probability="15" type="ts_http">
      <setdynvars sourcetype="random_string" length="12">
        <var name="qname"/>
      </setdynvars>
      <setdynvars sourcetype="file" fileid="message" delimiter=";" order="random">
        <var name="msgbody"/>
      </setdynvars>
      <setdynvars sourcetype="file" fileid="metadata" delimiter=";" order="random">
        <var name="qmetadata"/>
      </setdynvars>
      <setdynvars sourcetype="file" fileid="metadata" delimiter=";" order="random">
        <var name="qmetadata_updated"/>
      </setdynvars>
      <setdynvars sourcetype="file" fileid="projectid" delimiter=";" order="random">
        <var name="project_id"/>
      </setdynvars>

      <transaction name="create_queue">
        <request subst="true">
          <http url="/v1/queues/%%_qname%%" method="PUT" version="1.1" contents='%%_qmetadata%%' content_type='application/json'>
            <http_header name="User-Agent" value="Tsung-Agent"/>
            <http_header name="Client-ID" value="Tsung-Client"/>
            <http_header name="X-Auth-Token" value="XXXXX"/>
            <http_header name="X-Project-ID" value="project_id"/>
          </http>
        </request>
      </transaction>

      <transaction name="post_message">
        <request subst="true">
          <http url='/v1/1/queues/%%_qname%%/messages' version='1.1' contents='%%_msgbody%%' content_type='application/json' method='POST'>
            <http_header name="User-Agent" value="Tsung-Agent"/>
            <http_header name="Client-ID" value="Tsung-Client"/>
            <http_header name="X-Auth-Token" value="XXXXX"/>
            <http_header name="X-Project-ID" value="project_id"/>
          </http>
        </request>
      </transaction>

      <transaction name="update_queue">
        <request subst="true">
          <http url="/v1/queues/%%_qname%%" method="PUT" version="1.1" contents='%%_qmetadata_updated%%' content_type='application/json'>
            <http_header name="User-Agent" value="Tsung-Agent"/>
            <http_header name="Client-ID" value="Tsung-Client"/>
            <http_header name="X-Auth-Token" value="XXXXX"/>
            <http_header name="X-Project-ID" value="project_id"/>
          </http>
        </request>
      </transaction>

      <transaction name="delete_queue">
        <request subst="true">
          <http url="/v1/queues/%%_qname%%" method="DELETE" version="1.1">
            <http_header name="User-Agent" value="Tsung-Agent"/>
            <http_header name="Client-ID" value="Tsung-Client"/>
            <http_header name="X-Auth-Token" value="XXXXX"/>
            <http_header name="X-Project-ID" value="project_id"/>
          </http>
        </request>
      </transaction>

      <!--GET on a deleted Queue - Returns 404 -->
      <transaction name="get_queue">
        <request subst="true">
          <http url='/v1/1/queues/%%_qname%%' version='1.1' content_type='application/json' method='GET'>
            <http_header name="User-Agent" value="Tsung-Agent"/>
            <http_header name="Client-ID" value="Tsung-Client"/>
            <http_header name="X-Auth-Token" value="XXXXX"/>
            <http_header name="X-Project-ID" value="project_id"/>
          </http>
        </request>
      </transaction>
    </session>


  <!--
  Scenario-3 :
  1. Create Queue with random name (metadata will be random line from queuemetadata.csv)
  2. Post Message to the queue (message will be random line from msgbody.csv)
  3. Claim message
  4. Update Claim from Step 
  5. Delete Claimed messages
  6. Claim message
  7. Get Queue Stats
  8. Delete Queue-->
    <session name="Scenario-3" probability="30" type="ts_http">
      <setdynvars sourcetype="random_string" length="12">
        <var name="qname"/>
      </setdynvars>
      <setdynvars sourcetype="file" fileid="message" delimiter=";" order="random">
        <var name="msgbody"/>
      </setdynvars>
      <setdynvars sourcetype="file" fileid="metadata" delimiter=";" order="random">
        <var name="qmetadata"/>
      </setdynvars>
      <setdynvars sourcetype="file" fileid="claimdata" delimiter=";" order="random">
        <var name="claimbody"/>
      </setdynvars>
      <setdynvars sourcetype="file" fileid="claimdata" delimiter=";" order="random">
        <var name="claimbody_updated"/>
      </setdynvars>
      <setdynvars sourcetype="file" fileid="projectid" delimiter=";" order="random">
        <var name="project_id"/>
      </setdynvars>

      <transaction name="create_queue">
        <request subst="true">
          <http url="/v1/queues/%%_qname%%" method="PUT" version="1.1" contents='%%_qmetadata%%' content_type='application/json'>
            <http_header name="User-Agent" value="Tsung-Agent"/>
            <http_header name="Client-ID" value="Tsung-Client"/>
            <http_header name="X-Auth-Token" value="XXXXX"/>
            <http_header name="X-Project-ID" value="project_id"/>
          </http>
        </request>
      </transaction>

      <transaction name="post_message">
        <request subst="true">
          <http url='/v1/queues/%%_qname%%/messages' version='1.1' contents='%%_msgbody%%' content_type='application/json' method='POST'>
            <http_header name="User-Agent" value="Tsung-Agent"/>
            <http_header name="Client-ID" value="Tsung-Client"/>
            <http_header name="X-Auth-Token" value="XXXXX"/>
            <http_header name="X-Project-ID" value="project_id"/>
          </http>
        </request>
      </transaction>

      <transaction name="post_message">
        <request subst="true">
          <http url='/v1/queues/%%_qname%%/messages' version='1.1' contents='%%_msgbody%%' content_type='application/json' method='POST'>
            <http_header name="User-Agent" value="Tsung-Agent"/>
            <http_header name="Client-ID" value="Tsung-Client"/>
            <http_header name="X-Auth-Token" value="XXXXX"/>
            <http_header name="X-Project-ID" value="project_id"/>
          </http>
        </request>
      </transaction>

      <transaction name="post_claim">
        <request subst="true">
          <!--Extract href from response body -->
          <dyn_variable name="msgpath" jsonpath="[0].href"/>
          <!--Extract location from response header -->
          <dyn_variable name="location" re="Location: (.*)\r\n"/>
          <http url='/v1/queues/%%_qname%%/claims' version='1.1' contents='%%_claimbody%%' content_type='application/json' method='POST'>
            <http_header name="User-Agent" value="Tsung-Agent"/>
            <http_header name="Client-ID" value="Tsung-Client"/>
            <http_header name="X-Auth-Token" value="XXXXX"/>
            <http_header name="X-Project-ID" value="project_id"/>
          </http>
        </request>
      </transaction>

      <transaction name="get_message">
        <request subst="true">
          <http url="%%_msgpath%%" method="GET" version="1.1" content_type='application/json'>
            <http_header name="User-Agent" value="Tsung-Agent"/>
            <http_header name="Client-ID" value="Tsung-Client"/>
            <http_header name="X-Auth-Token" value="XXXXX"/>
            <http_header name="X-Project-ID" value="project_id"/>
          </http>
        </request>
      </transaction>

      <transaction name="update_claim">
        <request subst="true">
          <http url='%%_location%%' version='1.1' contents='%%_claimbody_updated%%' content_type='application/json' method='PATCH'>
            <http_header name="User-Agent" value="Tsung-Agent"/>
            <http_header name="Client-ID" value="Tsung-Client"/>
            <http_header name="X-Auth-Token" value="XXXXX"/>
            <http_header name="X-Project-ID" value="project_id"/>
          </http>
        </request>
      </transaction>

      <transaction name="get_claim">
        <request subst="true">
          <http url="%%_location%%" method="GET" version="1.1" content_type='application/json'>
            <http_header name="User-Agent" value="Tsung-Agent"/>
            <http_header name="Client-ID" value="Tsung-Client"/>
            <http_header name="X-Auth-Token" value="XXXXX"/>
            <http_header name="X-Project-ID" value="project_id"/>
          </http>
        </request>
      </transaction>

      <transaction name="delete_claim">
        <request subst="true">
          <http url="%%_location%%" method="DELETE" version="1.1" content_type='application/json'>
            <http_header name="User-Agent" value="Tsung-Agent"/>
            <http_header name="Client-ID" value="Tsung-Client"/>
            <http_header name="X-Auth-Token" value="XXXXX"/>
            <http_header name="X-Project-ID" value="project_id"/>
          </http>
        </request>
      </transaction>

      <transaction name="delete_queue">
        <request subst="true">
          <http url="/v1/queues/%%_qname%%" method="DELETE" version="1.1">
            <http_header name="User-Agent" value="Tsung-Agent"/>
            <http_header name="Client-ID" value="Tsung-Client"/>
            <http_header name="X-Auth-Token" value="XXXXX"/>
            <http_header name="X-Project-ID" value="project_id"/>
          </http>
        </request>
      </transaction>
    </session>


  <!--
  Scenario-4 :
  1. Create Queue with random name (metadata will be random line from queuemetadata.csv)
  2. Post Message to the queue (message will be random line from msgbody.csv)
  3. Claim message
  5. Delete Claimed messages
  8. Delete Queue-->
    <session name="Scenario-4" probability="30" type="ts_http">
      <setdynvars sourcetype="random_string" length="12">
        <var name="qname"/>
      </setdynvars>
      <setdynvars sourcetype="file" fileid="message" delimiter=";" order="random">
        <var name="msgbody"/>
      </setdynvars>
      <setdynvars sourcetype="file" fileid="metadata" delimiter=";" order="random">
        <var name="qmetadata"/>
      </setdynvars>
      <setdynvars sourcetype="file" fileid="claimdata" delimiter=";" order="random">
        <var name="claimbody"/>
      </setdynvars>
      <setdynvars sourcetype="file" fileid="projectid" delimiter=";" order="random">
        <var name="project_id"/>
      </setdynvars>

      <transaction name="create_queue">
        <request subst="true">
          <http url="/v1/queues/%%_qname%%" method="PUT" version="1.1" contents='%%_qmetadata%%' content_type='application/json'>
            <http_header name="User-Agent" value="Tsung-Agent"/>
            <http_header name="Client-ID" value="Tsung-Client"/>
            <http_header name="X-Auth-Token" value="XXXXX"/>
            <http_header name="X-Project-ID" value="project_id"/>
          </http>
        </request>
      </transaction>

      <transaction name="post_message">
        <request subst="true">
          <http url='/v1/1/queues/%%_qname%%/messages' version='1.1' contents='%%_msgbody%%' content_type='application/json' method='POST'>
            <http_header name="User-Agent" value="Tsung-Agent"/>
            <http_header name="Client-ID" value="Tsung-Client"/>
            <http_header name="X-Auth-Token" value="XXXXX"/>
            <http_header name="X-Project-ID" value="project_id"/>
          </http>
        </request>
      </transaction>

      <transaction name="post_claim">
        <request subst="true">
          <!--Extract href from response body -->
          <dyn_variable name="msgpath" jsonpath="[0].href"/>
          <!--Extract location from response header -->
          <dyn_variable name="location" re="Location: (.*)\r\n"/>
          <http url='/v1/1/queues/%%_qname%%/claims' version='1.1' contents='%%_claimbody%%' content_type='application/json' method='POST'>
            <http_header name="User-Agent" value="Tsung-Agent"/>
            <http_header name="Client-ID" value="Tsung-Client"/>
            <http_header name="X-Auth-Token" value="XXXXX"/>
            <http_header name="X-Project-ID" value="project_id"/>
          </http>
        </request>
      </transaction>

      <transaction name="delete_message">
        <request subst="true">
          <http url="%%_msgpath%%" method="DELETE" version="1.1" content_type='application/json'>
            <http_header name="User-Agent" value="Tsung-Agent"/>
            <http_header name="Client-ID" value="Tsung-Client"/>
            <http_header name="X-Auth-Token" value="XXXXX"/>
            <http_header name="X-Project-ID" value="project_id"/>
          </http>
        </request>
      </transaction>

      <!--GET deleted message -->
      <transaction name="get_message">
        <request subst="true">
          <http url="%%_msgpath%%" method="GET" version="1.1" content_type='application/json'>
            <http_header name="User-Agent" value="Tsung-Agent"/>
            <http_header name="Client-ID" value="Tsung-Client"/>
            <http_header name="X-Auth-Token" value="XXXXX"/>
            <http_header name="X-Project-ID" value="project_id"/>
          </http>
        </request>
      </transaction>

      <transaction name="delete_claim">
        <request subst="true">
          <http url="%%_location%%" method="DELETE" version="1.1" content_type='application/json'></http>
        </request>
      </transaction>

      <!--GET deleted claim -->
      <transaction name="get_claim">
        <request subst="true">
          <http url="%%_location%%" method="GET" version="1.1" content_type='application/json'>
            <http_header name="User-Agent" value="Tsung-Agent"/>
            <http_header name="Client-ID" value="Tsung-Client"/>
            <http_header name="X-Auth-Token" value="XXXXX"/>
            <http_header name="X-Project-ID" value="project_id"/>
          </http>
        </request>
      </transaction>

      <transaction name="delete_queue">
        <request subst="true">
          <http url="/v1/queues/%%_qname%%" method="DELETE" version="1.1">
            <http_header name="User-Agent" value="Tsung-Agent"/>
            <http_header name="Client-ID" value="Tsung-Client"/>
            <http_header name="X-Auth-Token" value="XXXXX"/>
            <http_header name="X-Project-ID" value="project_id"/>
          </http>
        </request>
      </transaction>
    </session>


  <!--
  Scenario-5 :
  1. List Queues - tenant with 10 queues
  2. List Queues - tenant with 100 queues
  3. List Queues - tenant with 1000 queues
  4. List Queues - tenant with 10,000 queues
  -->
    <session name="Scenario-5" probability="5" type="ts_http">

      <transaction name="list_10_queues">
        <request subst="true">
          <http url="/v1/queues?detailed=true" method="GET" version="1.1" content_type='application/json'>
            <http_header name="User-Agent" value="Tsung-Agent"/>
            <http_header name="Client-ID" value="Tsung-Client"/>
            <http_header name="X-Auth-Token" value="XXXXX"/>
            <http_header name="X-Project-ID" value="project_id"/>
          </http>
        </request>
      </transaction>

      <transaction name="list_100_queues">
        <request subst="true">
          <http url="/v1/queues?detailed=true" method="GET" version="1.1" content_type='application/json'>
            <http_header name="User-Agent" value="Tsung-Agent"/>
            <http_header name="Client-ID" value="Tsung-Client"/>
            <http_header name="X-Auth-Token" value="XXXXX"/>
            <http_header name="X-Project-ID" value="project_id"/>
          </http>
        </request>
      </transaction>

      <transaction name="list_1000_queues">
        <request subst="true">
          <http url="/v1/queues?detailed=true" method="GET" version="1.1" content_type='application/json'>
            <http_header name="User-Agent" value="Tsung-Agent"/>
            <http_header name="Client-ID" value="Tsung-Client"/>
            <http_header name="X-Auth-Token" value="XXXXX"/>
            <http_header name="X-Project-ID" value="project_id"/>
          </http>
        </request>
      </transaction>

      <transaction name="list_10000_queues">
        <request subst="true">
          <http url="/v1/queues?detailed=true" method="GET" version="1.1" content_type='application/json'>
            <http_header name="User-Agent" value="Tsung-Agent"/>
            <http_header name="Client-ID" value="Tsung-Client"/>
            <http_header name="X-Auth-Token" value="XXXXX"/>
            <http_header name="X-Project-ID" value="project_id"/>
          </http>
        </request>

      </transaction>
    </session>
  </sessions>
</tsung>